spec/fixtures/wsman/osd_concrete_job.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n1="http://schemas.dell.com/wbem/wscim/1/cim-schema/2/DCIM_OSDConcreteJob" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <s:Header>
        <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa:Action>
        <wsa:RelatesTo>uuid:392d8e46-26ca-16ca-8002-34e5aa565000</wsa:RelatesTo>
        <wsa:MessageID>uuid:40e91dda-26cf-16cf-a67e-d46bf0fa8c00</wsa:MessageID>
    </s:Header>
    <s:Body>
        <n1:DCIM_OSDConcreteJob>
            <n1:DeleteOnCompletion>false</n1:DeleteOnCompletion>
            <n1:InstanceID>DCIM_OSDConcreteJob:1</n1:InstanceID>
            <n1:JobName>BootToNetworkISO</n1:JobName>
            <n1:JobStatus>Rebooting to ISO</n1:JobStatus>
            <n1:Message xsi:nil="true"/>
            <n1:MessageID xsi:nil="true"/>
            <n1:Name>BootToNetworkISO</n1:Name>
        </n1:DCIM_OSDConcreteJob>
    </s:Body>
</s:Envelope>
